<abi-corpus version='2.3' path='libefivar.so' architecture='elf-amd-x86_64' soname='libefivar.so.1'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_efi_set_variable' version='libefivar.so.0' is-default-version='no' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_efi_set_variable_variadic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_append_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_chmod_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_del_variable' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_error_clear' version='LIBEFIVAR_1.30' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='mktime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='openat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='printf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='puts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='readdir64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sched_yield' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='secure_getenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='statfs64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcasestr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strptime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='tzset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='umask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unsetenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__timezone' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='timezone' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='dp-acpi.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-2'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-5'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-7'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-8' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-23'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-24' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-25'/>
    <typedef-decl name='__off64_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-16'/>
    <typedef-decl name='__off_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-13'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-18'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-31'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-32'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-33'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-34'/>
    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='src/dp-acpi.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-37' name='hid' filepath='src/dp-acpi.c' line='268' column='1'/>
      <parameter type-id='type-id-37' name='uid' filepath='src/dp-acpi.c' line='268' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='src/dp-acpi.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-acpi.c' line='288' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-acpi.c' line='288' column='1'/>
      <parameter type-id='type-id-37' name='hid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-37' name='uid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-37' name='cid' filepath='src/dp-acpi.c' line='289' column='1'/>
      <parameter type-id='type-id-38' name='hidstr' filepath='src/dp-acpi.c' line='290' column='1'/>
      <parameter type-id='type-id-38' name='uidstr' filepath='src/dp-acpi.c' line='290' column='1'/>
      <parameter type-id='type-id-38' name='cidstr' filepath='src/dp-acpi.c' line='291' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-34' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-29'/>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-38'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vfprintf'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-38'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-40'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-hw.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <return type-id='type-id-24'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='src/dp-hw.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-48' name='device' filepath='src/dp-hw.c' line='73' column='1'/>
      <parameter type-id='type-id-48' name='function' filepath='src/dp-hw.c' line='73' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='src/dp-hw.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-hw.c' line='92' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-hw.c' line='92' column='1'/>
      <parameter type-id='type-id-37' name='hardware_device' filepath='src/dp-hw.c' line='92' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-47' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-45'/>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-media.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <return type-id='type-id-24'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='src/dp-media.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-media.c' line='140' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-media.c' line='140' column='1'/>
      <parameter type-id='type-id-10' name='filepath' filepath='src/dp-media.c' line='140' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='src/dp-media.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-media.c' line='168' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-media.c' line='168' column='1'/>
      <parameter type-id='type-id-37' name='num' filepath='src/dp-media.c' line='168' column='1'/>
      <parameter type-id='type-id-52' name='part_start' filepath='src/dp-media.c' line='168' column='1'/>
      <parameter type-id='type-id-52' name='part_size' filepath='src/dp-media.c' line='169' column='1'/>
      <parameter type-id='type-id-35' name='signature' filepath='src/dp-media.c' line='169' column='1'/>
      <parameter type-id='type-id-48' name='format' filepath='src/dp-media.c' line='169' column='1'/>
      <parameter type-id='type-id-48' name='signature_type' filepath='src/dp-media.c' line='170' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <var-decl name='efi_guid_empty' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='15' column='1'/>
    <typedef-decl name='DIR' type-id='type-id-51' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-49'/>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dp-message.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='short int' size-in-bits='16' id='type-id-53'/>
    <typedef-decl name='__int16_t' type-id='type-id-53' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-54'/>
    <typedef-decl name='int16_t' type-id='type-id-54' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-55'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-58'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='src/dp-message.c' line='647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='647' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='647' column='1'/>
      <parameter type-id='type-id-48' name='if_type' filepath='src/dp-message.c' line='647' column='1'/>
      <parameter type-id='type-id-58' name='mac_addr' filepath='src/dp-message.c' line='648' column='1'/>
      <parameter type-id='type-id-36' name='mac_addr_size' filepath='src/dp-message.c' line='648' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/dp-message.c' line='668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='668' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='668' column='1'/>
      <parameter type-id='type-id-37' name='local' filepath='src/dp-message.c' line='668' column='1'/>
      <parameter type-id='type-id-37' name='remote' filepath='src/dp-message.c' line='668' column='1'/>
      <parameter type-id='type-id-37' name='gateway' filepath='src/dp-message.c' line='669' column='1'/>
      <parameter type-id='type-id-37' name='netmask' filepath='src/dp-message.c' line='669' column='1'/>
      <parameter type-id='type-id-63' name='local_port' filepath='src/dp-message.c' line='670' column='1'/>
      <parameter type-id='type-id-63' name='remote_port' filepath='src/dp-message.c' line='670' column='1'/>
      <parameter type-id='type-id-63' name='protocol' filepath='src/dp-message.c' line='671' column='1'/>
      <parameter type-id='type-id-9' name='is_static' filepath='src/dp-message.c' line='671' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/dp-message.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='697' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='697' column='1'/>
      <parameter type-id='type-id-63' name='target' filepath='src/dp-message.c' line='697' column='1'/>
      <parameter type-id='type-id-63' name='lun' filepath='src/dp-message.c' line='697' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/dp-message.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='715' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='715' column='1'/>
      <parameter type-id='type-id-37' name='namespace_id' filepath='src/dp-message.c' line='715' column='1'/>
      <parameter type-id='type-id-35' name='ieee_eui_64' filepath='src/dp-message.c' line='716' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/dp-message.c' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='741' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='741' column='1'/>
      <parameter type-id='type-id-63' name='hba_port' filepath='src/dp-message.c' line='741' column='1'/>
      <parameter type-id='type-id-55' name='port_multiplier_port' filepath='src/dp-message.c' line='742' column='1'/>
      <parameter type-id='type-id-63' name='lun' filepath='src/dp-message.c' line='742' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/dp-message.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-63' name='primary' filepath='src/dp-message.c' line='763' column='1'/>
      <parameter type-id='type-id-63' name='slave' filepath='src/dp-message.c' line='764' column='1'/>
      <parameter type-id='type-id-63' name='lun' filepath='src/dp-message.c' line='764' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/dp-message.c' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='786' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='786' column='1'/>
      <parameter type-id='type-id-52' name='sas_address' filepath='src/dp-message.c' line='786' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/dp-message.c' line='811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='811' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='811' column='1'/>
      <parameter type-id='type-id-59' name='uuid' filepath='src/dp-message.c' line='811' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/dp-message.c' line='830' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='830' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='830' column='1'/>
      <parameter type-id='type-id-37' name='slot_id' filepath='src/dp-message.c' line='830' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-62' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-60'/>
  </abi-instr>
  <abi-instr address-size='64' path='dp.c' comp-dir-path='src' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='unknown' id='type-id-64'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='unknown' id='type-id-67'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-65'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-9'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-26'/>
    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='adr' type-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hidstr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='primary' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='slave' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_type' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='status' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface_type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='base_addr' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='addr_type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='boot_catalog_entry' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partition_rba' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sectors' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_ipv6' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='addrs' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wwn' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pi_info' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='partition_number' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signature' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='signature_type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resource_flags' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port_gid' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='target_port_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv4_addr' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_ipv4_addr' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='local_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='remote_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='protocol' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='static_ip_addr' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='gateway' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='netmask' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ipv6_addr' size-in-bits='480' is-struct='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='local_ipv6_addr' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='remote_ipv6_addr' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='local_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='remote_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocol' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='ip_addr_origin' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='prefix_length' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='gateway_ipv6_addr' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='options' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpgt' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='target_name' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lun' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac_addr' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='if_type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memory_type' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starting_address' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ending_address' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vendor_data' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uuid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namespace_id' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee_eui_64' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='645' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='function' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='device' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='766' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='protocol_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='start_addr' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end_addr' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='disk_type_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='instance_number' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first_byte' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_byte' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sas_address' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_topology_info' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drive_bay_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='rtp' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sas_address' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lun' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='device_topology_info' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='drive_bay_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='rtp' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hba_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='port_multiplier_port' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='lun' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='slot_number' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='baud_rate' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_bits' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='parity' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='stop_bits' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-172' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_control_map' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='553' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='target_id' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='lun' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uri' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parent_port' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='interface' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='product_id' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_class' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='device_subclass' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='device_protocol' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interface' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vendor_id' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product_id' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='serial_number' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vlan_id' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssid' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-189'/>
    <typedef-decl name='__uint16_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-190'/>
    <typedef-decl name='__uint32_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-191'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-192'/>
    <typedef-decl name='__uint8_t' type-id='type-id-193' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-194'/>
    <typedef-decl name='const_efidp' type-id='type-id-195' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-196'/>
    <typedef-decl name='efi_guid_t' type-id='type-id-68' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-42'/>
    <typedef-decl name='efi_ip_addr_t' type-id='type-id-197' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-66'/>
    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-71' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-70'/>
    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-74' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-73'/>
    <typedef-decl name='efidp' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' id='type-id-199'/>
    <typedef-decl name='efidp_1394' type-id='type-id-77' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-76'/>
    <typedef-decl name='efidp_acpi_adr' type-id='type-id-80' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-79'/>
    <typedef-decl name='efidp_acpi_hid' type-id='type-id-83' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-82'/>
    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-85' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-84'/>
    <typedef-decl name='efidp_atapi' type-id='type-id-87' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-86'/>
    <typedef-decl name='efidp_bios_boot' type-id='type-id-89' filepath='src/include/efivar/efivar-dp.h' line='816' column='1' id='type-id-88'/>
    <typedef-decl name='efidp_bmc' type-id='type-id-92' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-91'/>
    <typedef-decl name='efidp_boolean' type-id='type-id-48' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-130'/>
    <typedef-decl name='efidp_bt' type-id='type-id-94' filepath='src/include/efivar/efivar-dp.h' line='673' column='1' id='type-id-93'/>
    <typedef-decl name='efidp_btle' type-id='type-id-96' filepath='src/include/efivar/efivar-dp.h' line='694' column='1' id='type-id-95'/>
    <typedef-decl name='efidp_cdrom' type-id='type-id-98' filepath='src/include/efivar/efivar-dp.h' line='745' column='1' id='type-id-97'/>
    <typedef-decl name='efidp_controller' type-id='type-id-100' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-99'/>
    <typedef-decl name='efidp_data' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='888' column='1' id='type-id-201'/>
    <typedef-decl name='efidp_dns' type-id='type-id-102' filepath='src/include/efivar/efivar-dp.h' line='704' column='1' id='type-id-101'/>
    <typedef-decl name='efidp_emmc' type-id='type-id-104' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-103'/>
    <typedef-decl name='efidp_fc' type-id='type-id-106' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-105'/>
    <typedef-decl name='efidp_fcex' type-id='type-id-108' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-107'/>
    <typedef-decl name='efidp_file' type-id='type-id-111' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-110'/>
    <typedef-decl name='efidp_firmware_file' type-id='type-id-114' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-113'/>
    <typedef-decl name='efidp_firmware_volume' type-id='type-id-116' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-115'/>
    <typedef-decl name='efidp_hd' type-id='type-id-118' filepath='src/include/efivar/efivar-dp.h' line='726' column='1' id='type-id-117'/>
    <typedef-decl name='efidp_header' type-id='type-id-119' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-78'/>
    <typedef-decl name='efidp_hw_vendor' type-id='type-id-121' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-120'/>
    <typedef-decl name='efidp_i2o' type-id='type-id-123' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-122'/>
    <typedef-decl name='efidp_infiniband' type-id='type-id-125' filepath='src/include/efivar/efivar-dp.h' line='497' column='1' id='type-id-124'/>
    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-129' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-128'/>
    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-131'/>
    <typedef-decl name='efidp_iscsi' type-id='type-id-134' filepath='src/include/efivar/efivar-dp.h' line='614' column='1' id='type-id-133'/>
    <typedef-decl name='efidp_lun' type-id='type-id-136' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-135'/>
    <typedef-decl name='efidp_mac_addr' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-137'/>
    <typedef-decl name='efidp_media_vendor' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='752' column='1' id='type-id-140'/>
    <typedef-decl name='efidp_mmio' type-id='type-id-143' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-142'/>
    <typedef-decl name='efidp_msg_vendor' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='541' column='1' id='type-id-144'/>
    <typedef-decl name='efidp_nvdimm' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-146'/>
    <typedef-decl name='efidp_nvme' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-148'/>
    <typedef-decl name='efidp_pccard' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-150'/>
    <typedef-decl name='efidp_pci' type-id='type-id-153' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-152'/>
    <typedef-decl name='efidp_protocol' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-154'/>
    <typedef-decl name='efidp_ramdisk' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='798' column='1' id='type-id-156'/>
    <typedef-decl name='efidp_relative_offset' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-158'/>
    <typedef-decl name='efidp_sas' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' id='type-id-160'/>
    <typedef-decl name='efidp_sas_ex' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='601' column='1' id='type-id-162'/>
    <typedef-decl name='efidp_sata' type-id='type-id-165' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-164'/>
    <typedef-decl name='efidp_scsi' type-id='type-id-167' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-166'/>
    <typedef-decl name='efidp_sd' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='667' column='1' id='type-id-168'/>
    <typedef-decl name='efidp_uart' type-id='type-id-171' filepath='src/include/efivar/efivar-dp.h' line='513' column='1' id='type-id-170'/>
    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='554' column='1' id='type-id-172'/>
    <typedef-decl name='efidp_ufs' type-id='type-id-175' filepath='src/include/efivar/efivar-dp.h' line='661' column='1' id='type-id-174'/>
    <typedef-decl name='efidp_uri' type-id='type-id-177' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-176'/>
    <typedef-decl name='efidp_usb' type-id='type-id-179' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-178'/>
    <typedef-decl name='efidp_usb_class' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-180'/>
    <typedef-decl name='efidp_usb_wwid' type-id='type-id-183' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-182'/>
    <typedef-decl name='efidp_vlan' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='484' column='1' id='type-id-184'/>
    <typedef-decl name='efidp_wifi' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='679' column='1' id='type-id-186'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/14/include/stddef.h' line='214' column='1' id='type-id-40'/>
    <typedef-decl name='ssize_t' type-id='type-id-189' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-36'/>
    <typedef-decl name='uint16_t' type-id='type-id-190' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-63'/>
    <typedef-decl name='uint32_t' type-id='type-id-191' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-37'/>
    <typedef-decl name='uint64_t' type-id='type-id-192' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-52'/>
    <typedef-decl name='uint8_t' type-id='type-id-194' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-48'/>
    <array-type-def dimensions='1' type-id='type-id-63' size-in-bits='unknown' id='type-id-112'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='128' id='type-id-202'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='unknown' id='type-id-81'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='128' id='type-id-126'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-204'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='128' id='type-id-75'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' id='type-id-205'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='256' id='type-id-139'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' id='type-id-206'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='32' id='type-id-72'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='48' id='type-id-69'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' id='type-id-207'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='64' id='type-id-109'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-3' id='type-id-208'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='unknown' id='type-id-90'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-65'/>
    </array-type-def>
    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-197'>
      <data-member access='public'>
        <var-decl name='addr' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v4' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v6' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='efidp_data' size-in-bits='480' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='830' column='1' id='type-id-200'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='header' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pci' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pccard' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mmio' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hw_vendor' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='controller' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bmc' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_hid_ex' type-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='acpi_adr' type-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='atapi' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fc' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fcex' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firewire' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_class' type-id='type-id-180' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='usb_wwid' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='lun' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sata' type-id='type-id-164' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i2o' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mac_addr' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv4_addr' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ipv6_addr' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='vlan' type-id='type-id-184' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='infiniband' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_vendor' type-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uart_flow_control' type-id='type-id-172' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sas_ex' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iscsi' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme' type-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uri' type-id='type-id-176' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ufs' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sd' type-id='type-id-168' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bt' type-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='wifi' type-id='type-id-186' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='emmc' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='btle' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dns' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvdimm' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hd' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdrom' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='media_vendor' type-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='protocol' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_file' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='firmware_volume' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='relative_offset' type-id='type-id-158' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ramdisk' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bios_boot' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1' id='type-id-127'>
      <data-member access='public'>
        <var-decl name='ioc_guid' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='service_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-193'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-22'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-14'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-10'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-209'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-215'/>
    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' filepath='src/dp.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0'>
      <parameter type-id='type-id-196' name='dn' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-19' name='buf' filepath='src/dp.c' line='33' column='1'/>
      <parameter type-id='type-id-40' name='bufsize' filepath='src/dp.c' line='33' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' filepath='src/dp.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='87' column='1'/>
      <parameter type-id='type-id-211' name='out' filepath='src/dp.c' line='87' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' filepath='src/dp.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
      <parameter type-id='type-id-196' name='dp0' filepath='src/dp.c' line='97' column='1'/>
      <parameter type-id='type-id-196' name='dp1' filepath='src/dp.c' line='97' column='1'/>
      <parameter type-id='type-id-211' name='out' filepath='src/dp.c' line='97' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' filepath='src/dp.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='179' column='1'/>
      <parameter type-id='type-id-196' name='dn' filepath='src/dp.c' line='179' column='1'/>
      <parameter type-id='type-id-211' name='out' filepath='src/dp.c' line='179' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' filepath='src/dp.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='241' column='1'/>
      <parameter type-id='type-id-196' name='dpi' filepath='src/dp.c' line='241' column='1'/>
      <parameter type-id='type-id-211' name='out' filepath='src/dp.c' line='241' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' filepath='src/dp.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-212' name='buf' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-196' name='dp' filepath='src/dp.c' line='288' column='1'/>
      <parameter type-id='type-id-36' name='limit' filepath='src/dp.c' line='289' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' filepath='src/dp.c' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
      <parameter type-id='type-id-212' name='path' filepath='src/dp.c' line='393' column='1'/>
      <parameter type-id='type-id-199' name='out' filepath='src/dp.c' line='394' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='src/dp.c' line='394' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' filepath='src/dp.c' line='402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
      <parameter type-id='type-id-212' name='path' filepath='src/dp.c' line='402' column='1'/>
      <parameter type-id='type-id-199' name='out' filepath='src/dp.c' line='402' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='src/dp.c' line='403' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' filepath='src/dp.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-48' name='type' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-48' name='subtype' filepath='src/dp.c' line='411' column='1'/>
      <parameter type-id='type-id-42' name='vendor_guid' filepath='src/dp.c' line='412' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='src/dp.c' line='412' column='1'/>
      <parameter type-id='type-id-40' name='data_size' filepath='src/dp.c' line='412' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='src/dp.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='buf' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-36' name='size' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-48' name='type' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-48' name='subtype' filepath='src/dp.c' line='427' column='1'/>
      <parameter type-id='type-id-36' name='total_size' filepath='src/dp.c' line='428' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-215' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-213'/>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-216'/>
    <type-decl name='void' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' id='type-id-19'/>
  </abi-instr>
  <abi-instr address-size='64' path='efivarfs.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-217' size-in-bits='256' id='type-id-218'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-219' size-in-bits='192' id='type-id-220'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' id='type-id-221'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2040' id='type-id-222'>
      <subrange length='255' lower-bound='0' upper-bound='254' type-id='type-id-3' id='type-id-223'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2048' id='type-id-224'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-3' id='type-id-225'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='64' id='type-id-226'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-204'/>
    </array-type-def>
    <class-decl name='__fsid_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-227' visibility='default' filepath='/usr/include/bits/types.h' line='155' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-226' visibility='default' filepath='/usr/include/bits/types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-230' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-193' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-224' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='efi_var_operations' size-in-bits='2624' is-struct='yes' visibility='default' filepath='src/lib.h' line='26' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-222' visibility='default' filepath='src/lib.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='probe' type-id='type-id-232' visibility='default' filepath='src/lib.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='set_variable' type-id='type-id-233' visibility='default' filepath='src/lib.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='del_variable' type-id='type-id-234' visibility='default' filepath='src/lib.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='get_variable' type-id='type-id-235' visibility='default' filepath='src/lib.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='get_variable_attributes' type-id='type-id-236' visibility='default' filepath='src/lib.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='get_variable_size' type-id='type-id-237' visibility='default' filepath='src/lib.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='get_next_variable_name' type-id='type-id-238' visibility='default' filepath='src/lib.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='append_variable' type-id='type-id-239' visibility='default' filepath='src/lib.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='chmod_variable' type-id='type-id-240' visibility='default' filepath='src/lib.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-242' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-243' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-244' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-245' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-246' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-242' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-248' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-249' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-250' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-250' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-250' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-220' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='statfs' size-in-bits='960' is-struct='yes' visibility='default' filepath='/usr/include/bits/statfs.h' line='24' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-252' visibility='default' filepath='/usr/include/bits/statfs.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-252' visibility='default' filepath='/usr/include/bits/statfs.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-252' visibility='default' filepath='/usr/include/bits/statfs.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/statfs.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/statfs.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-227' visibility='default' filepath='/usr/include/bits/statfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/statfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-218' visibility='default' filepath='/usr/include/bits/statfs.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-254' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-219' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__blkcnt_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-249'/>
    <typedef-decl name='__blksize_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-248'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-242'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='185' column='1' id='type-id-252'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-253'/>
    <typedef-decl name='__fsid_t' type-id='type-id-228' filepath='/usr/include/bits/types.h' line='155' column='1' id='type-id-227'/>
    <typedef-decl name='__fsword_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='192' column='1' id='type-id-217'/>
    <typedef-decl name='__gid_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-247'/>
    <typedef-decl name='__ino64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-230'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-243'/>
    <typedef-decl name='__mode_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-245'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-244'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-219'/>
    <typedef-decl name='__time_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-254'/>
    <typedef-decl name='__uid_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-246'/>
    <typedef-decl name='__useconds_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='161' column='1' id='type-id-255'/>
    <typedef-decl name='mode_t' type-id='type-id-245' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-256'/>
    <qualified-type-def type-id='type-id-41' restrict='yes' id='type-id-257'/>
    <qualified-type-def type-id='type-id-38' restrict='yes' id='type-id-258'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-271'/>
    <qualified-type-def type-id='type-id-271' restrict='yes' id='type-id-272'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-278'/>
    <var-decl name='efivarfs_ops' type-id='type-id-231' visibility='default' filepath='src/lib.h' line='48' column='1'/>
    <typedef-decl name='DIR' type-id='type-id-278' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-276'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-277'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='dirfd' filepath='/usr/include/dirent.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dirfd'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='err' filepath='/usr/include/err.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='err'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-38'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl64' filepath='/usr/include/fcntl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fcntl64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-9'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asprintf'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-258'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='__isoc23_strtoul' filepath='/usr/include/stdlib.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtoul'>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='secure_getenv' filepath='/usr/include/stdlib.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='secure_getenv'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64'>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-272'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chmod'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='statfs' mangled-name='statfs64' filepath='/usr/include/sys/statfs.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statfs64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-273'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='usleep' filepath='/usr/include/unistd.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='usleep'>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='geteuid'>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-261'>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-263'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-266'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-267'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-268'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-265'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-269'>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='error.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='_IO_cookie_io_functions_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='55' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read' type-id='type-id-280' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write' type-id='type-id-281' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seek' type-id='type-id-282' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close' type-id='type-id-283' visibility='default' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cookie_close_function_t' type-id='type-id-284' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='48' column='1' id='type-id-285'/>
    <typedef-decl name='cookie_io_functions_t' type-id='type-id-279' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='61' column='1' id='type-id-286'/>
    <typedef-decl name='cookie_read_function_t' type-id='type-id-287' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='27' column='1' id='type-id-288'/>
    <typedef-decl name='cookie_seek_function_t' type-id='type-id-289' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='45' column='1' id='type-id-290'/>
    <typedef-decl name='cookie_write_function_t' type-id='type-id-291' filepath='/usr/include/bits/types/cookie_io_functions_t.h' line='36' column='1' id='type-id-292'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-293'/>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-294'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-296'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-297'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-298'/>
    <function-decl name='efi_error_get' mangled-name='efi_error_get' filepath='src/error.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_get@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-22' name='n' filepath='src/error.c' line='33' column='1'/>
      <parameter type-id='type-id-294' name='filename' filepath='src/error.c' line='34' column='1'/>
      <parameter type-id='type-id-294' name='function' filepath='src/error.c' line='35' column='1'/>
      <parameter type-id='type-id-39' name='line' filepath='src/error.c' line='36' column='1'/>
      <parameter type-id='type-id-294' name='message' filepath='src/error.c' line='37' column='1'/>
      <parameter type-id='type-id-39' name='error' filepath='src/error.c' line='38' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/error.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_set@@LIBEFIVAR_1.30'>
      <parameter type-id='type-id-38' name='filename' filepath='src/error.c' line='75' column='1'/>
      <parameter type-id='type-id-38' name='function' filepath='src/error.c' line='76' column='1'/>
      <parameter type-id='type-id-9' name='line' filepath='src/error.c' line='77' column='1'/>
      <parameter type-id='type-id-9' name='error' filepath='src/error.c' line='78' column='1'/>
      <parameter type-id='type-id-38' name='fmt' filepath='src/error.c' line='79' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_error_pop' mangled-name='efi_error_pop' filepath='src/error.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_pop@@LIBEFIVAR_1.38'>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='efi_set_loglevel' mangled-name='efi_set_loglevel' filepath='src/error.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38'>
      <parameter type-id='type-id-9' name='level' filepath='src/error.c' line='151' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='src/error.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_error_clear@@LIBEFIVAR_1.30'>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/error.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='efi_set_verbose' mangled-name='efi_set_verbose' filepath='src/error.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_verbose@@LIBEFIVAR_1.36'>
      <parameter type-id='type-id-9' name='verbosity' filepath='src/error.c' line='279' column='1'/>
      <parameter type-id='type-id-27' name='errlog' filepath='src/error.c' line='279' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' filepath='src/error.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36'>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-297' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-295'/>
    <var-decl name='stderr' type-id='type-id-27' visibility='default' filepath='/usr/include/stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fopencookie' filepath='/usr/include/stdio.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopencookie'>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/usr/include/stdio.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fseek'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftell'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getrandom' filepath='/usr/include/sys/random.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrandom'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-289'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-287'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-189'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-291'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-189'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='export.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/lib.h' line='18' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrs' type-id='type-id-52' visibility='default' filepath='src/lib.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guid' type-id='type-id-59' visibility='default' filepath='src/lib.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-212' visibility='default' filepath='src/lib.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-35' visibility='default' filepath='src/lib.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-40' visibility='default' filepath='src/lib.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_variable_t' type-id='type-id-299' filepath='src/include/efivar/efivar.h' line='82' column='1' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-306'/>
    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='src/export.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
      <parameter type-id='type-id-35' name='data' filepath='src/export.c' line='314' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='src/export.c' line='314' column='1'/>
      <parameter type-id='type-id-302' name='var_out' filepath='src/export.c' line='314' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efi_variable_export_dmpstore' mangled-name='efi_variable_export_dmpstore' filepath='src/export.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export_dmpstore@@LIBEFIVAR_1.38'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='327' column='1'/>
      <parameter type-id='type-id-35' name='data' filepath='src/export.c' line='327' column='1'/>
      <parameter type-id='type-id-40' name='datasz' filepath='src/export.c' line='327' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='src/export.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-35' name='data' filepath='src/export.c' line='457' column='1'/>
      <parameter type-id='type-id-40' name='datasz' filepath='src/export.c' line='457' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efi_variable_alloc' mangled-name='efi_variable_alloc' filepath='src/export.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_alloc@@LIBEFIVAR_1.38'>
      <return type-id='type-id-301'/>
    </function-decl>
    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='src/export.c' line='606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='606' column='1'/>
      <parameter type-id='type-id-9' name='free_data' filepath='src/export.c' line='606' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='src/export.c' line='627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='627' column='1'/>
      <parameter type-id='type-id-212' name='name' filepath='src/export.c' line='627' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='src/export.c' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='634' column='1'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='src/export.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='645' column='1'/>
      <parameter type-id='type-id-59' name='guid' filepath='src/export.c' line='645' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='src/export.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='652' column='1'/>
      <parameter type-id='type-id-260' name='guid' filepath='src/export.c' line='652' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='src/export.c' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='664' column='1'/>
      <parameter type-id='type-id-35' name='data' filepath='src/export.c' line='664' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='src/export.c' line='664' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='src/export.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='677' column='1'/>
      <parameter type-id='type-id-275' name='data' filepath='src/export.c' line='677' column='1'/>
      <parameter type-id='type-id-270' name='size' filepath='src/export.c' line='677' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='src/export.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='690' column='1'/>
      <parameter type-id='type-id-52' name='attrs' filepath='src/export.c' line='690' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='src/export.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='697' column='1'/>
      <parameter type-id='type-id-303' name='attrs' filepath='src/export.c' line='697' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='src/export.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0'>
      <parameter type-id='type-id-301' name='var' filepath='src/export.c' line='709' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-306' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-304'/>
  </abi-instr>
  <abi-instr address-size='64' path='guid-symbols.c' comp-dir-path='src' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-307' size-in-bits='263424' id='type-id-308'>
      <subrange length='42' lower-bound='0' upper-bound='41' type-id='type-id-3' id='type-id-309'/>
    </array-type-def>
    <var-decl name='efi_guid_zero' type-id='type-id-43' mangled-name='efi_guid_zero' visibility='default' filepath='src/guid-symbols.c' line='27' column='1' elf-symbol-id='efi_guid_zero@@libefivar.so.0'/>
    <var-decl name='efi_guid_redhat_2' type-id='type-id-43' mangled-name='efi_guid_redhat_2' visibility='default' filepath='src/guid-symbols.c' line='32' column='1' elf-symbol-id='efi_guid_redhat_2@@libefivar.so.0'/>
    <var-decl name='efi_guid_redhat' type-id='type-id-43' mangled-name='efi_guid_redhat' visibility='default' filepath='src/guid-symbols.c' line='36' column='1' elf-symbol-id='efi_guid_redhat@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha512' type-id='type-id-43' mangled-name='efi_guid_sha512' visibility='default' filepath='src/guid-symbols.c' line='40' column='1' elf-symbol-id='efi_guid_sha512@@libefivar.so.0'/>
    <var-decl name='efi_guid_fwupdate' type-id='type-id-43' mangled-name='efi_guid_fwupdate' visibility='default' filepath='src/guid-symbols.c' line='44' column='1' elf-symbol-id='efi_guid_fwupdate@@LIBEFIVAR_1.35'/>
    <var-decl name='efi_guid_sha224' type-id='type-id-43' mangled-name='efi_guid_sha224' visibility='default' filepath='src/guid-symbols.c' line='48' column='1' elf-symbol-id='efi_guid_sha224@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_boot_menu' type-id='type-id-43' mangled-name='efi_guid_lenovo_boot_menu' visibility='default' filepath='src/guid-symbols.c' line='52' column='1' elf-symbol-id='efi_guid_lenovo_boot_menu@@libefivar.so.0'/>
    <var-decl name='efi_guid_supermicro' type-id='type-id-43' mangled-name='efi_guid_supermicro' visibility='default' filepath='src/guid-symbols.c' line='56' column='1' elf-symbol-id='efi_guid_supermicro@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_asus' type-id='type-id-43' mangled-name='efi_guid_asus' visibility='default' filepath='src/guid-symbols.c' line='60' column='1' elf-symbol-id='efi_guid_asus@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_ux_capsule' type-id='type-id-43' mangled-name='efi_guid_ux_capsule' visibility='default' filepath='src/guid-symbols.c' line='64' column='1' elf-symbol-id='efi_guid_ux_capsule@@LIBEFIVAR_1.33'/>
    <var-decl name='efi_guid_x509_sha256' type-id='type-id-43' mangled-name='efi_guid_x509_sha256' visibility='default' filepath='src/guid-symbols.c' line='68' column='1' elf-symbol-id='efi_guid_x509_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048' type-id='type-id-43' mangled-name='efi_guid_rsa2048' visibility='default' filepath='src/guid-symbols.c' line='72' column='1' elf-symbol-id='efi_guid_rsa2048@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo' type-id='type-id-43' mangled-name='efi_guid_lenovo' visibility='default' filepath='src/guid-symbols.c' line='76' column='1' elf-symbol-id='efi_guid_lenovo@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_diag' type-id='type-id-43' mangled-name='efi_guid_lenovo_diag' visibility='default' filepath='src/guid-symbols.c' line='80' column='1' elf-symbol-id='efi_guid_lenovo_diag@@libefivar.so.0'/>
    <var-decl name='efi_guid_x509_sha512' type-id='type-id-43' mangled-name='efi_guid_x509_sha512' visibility='default' filepath='src/guid-symbols.c' line='84' column='1' elf-symbol-id='efi_guid_x509_sha512@@libefivar.so.0'/>
    <var-decl name='efi_guid_external_management' type-id='type-id-43' mangled-name='efi_guid_external_management' visibility='default' filepath='src/guid-symbols.c' line='88' column='1' elf-symbol-id='efi_guid_external_management@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_pkcs7_cert' type-id='type-id-43' mangled-name='efi_guid_pkcs7_cert' visibility='default' filepath='src/guid-symbols.c' line='92' column='1' elf-symbol-id='efi_guid_pkcs7_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_fives' type-id='type-id-43' mangled-name='efi_guid_fives' visibility='default' filepath='src/guid-symbols.c' line='96' column='1' elf-symbol-id='efi_guid_fives@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_shim' type-id='type-id-43' mangled-name='efi_guid_shim' visibility='default' filepath='src/guid-symbols.c' line='100' column='1' elf-symbol-id='efi_guid_shim@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_rescue' type-id='type-id-43' mangled-name='efi_guid_lenovo_rescue' visibility='default' filepath='src/guid-symbols.c' line='104' column='1' elf-symbol-id='efi_guid_lenovo_rescue@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha1' type-id='type-id-43' mangled-name='efi_guid_rsa2048_sha1' visibility='default' filepath='src/guid-symbols.c' line='108' column='1' elf-symbol-id='efi_guid_rsa2048_sha1@@libefivar.so.0'/>
    <var-decl name='efi_guid_canonical' type-id='type-id-43' mangled-name='efi_guid_canonical' visibility='default' filepath='src/guid-symbols.c' line='112' column='1' elf-symbol-id='efi_guid_canonical@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_dell' type-id='type-id-43' mangled-name='efi_guid_dell' visibility='default' filepath='src/guid-symbols.c' line='116' column='1' elf-symbol-id='efi_guid_dell@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_x509_sha384' type-id='type-id-43' mangled-name='efi_guid_x509_sha384' visibility='default' filepath='src/guid-symbols.c' line='120' column='1' elf-symbol-id='efi_guid_x509_sha384@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_setup' type-id='type-id-43' mangled-name='efi_guid_lenovo_setup' visibility='default' filepath='src/guid-symbols.c' line='124' column='1' elf-symbol-id='efi_guid_lenovo_setup@@libefivar.so.0'/>
    <var-decl name='efi_guid_microsoft' type-id='type-id-43' mangled-name='efi_guid_microsoft' visibility='default' filepath='src/guid-symbols.c' line='128' column='1' elf-symbol-id='efi_guid_microsoft@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_2' type-id='type-id-43' mangled-name='efi_guid_lenovo_2' visibility='default' filepath='src/guid-symbols.c' line='132' column='1' elf-symbol-id='efi_guid_lenovo_2@@libefivar.so.0'/>
    <var-decl name='efi_guid_auto_created_boot_option' type-id='type-id-43' mangled-name='efi_guid_auto_created_boot_option' visibility='default' filepath='src/guid-symbols.c' line='136' column='1' elf-symbol-id='efi_guid_auto_created_boot_option@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_sha1' type-id='type-id-43' mangled-name='efi_guid_sha1' visibility='default' filepath='src/guid-symbols.c' line='140' column='1' elf-symbol-id='efi_guid_sha1@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_me_config' type-id='type-id-43' mangled-name='efi_guid_lenovo_me_config' visibility='default' filepath='src/guid-symbols.c' line='144' column='1' elf-symbol-id='efi_guid_lenovo_me_config@@libefivar.so.0'/>
    <var-decl name='efi_guid_global' type-id='type-id-43' mangled-name='efi_guid_global' visibility='default' filepath='src/guid-symbols.c' line='148' column='1' elf-symbol-id='efi_guid_global@@libefivar.so.0'/>
    <var-decl name='efi_guid_grub' type-id='type-id-43' mangled-name='efi_guid_grub' visibility='default' filepath='src/guid-symbols.c' line='152' column='1' elf-symbol-id='efi_guid_grub@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_guid_x509_cert' type-id='type-id-43' mangled-name='efi_guid_x509_cert' visibility='default' filepath='src/guid-symbols.c' line='156' column='1' elf-symbol-id='efi_guid_x509_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha256_cert' type-id='type-id-43' mangled-name='efi_guid_rsa2048_sha256_cert' visibility='default' filepath='src/guid-symbols.c' line='160' column='1' elf-symbol-id='efi_guid_rsa2048_sha256_cert@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_diag_splash' type-id='type-id-43' mangled-name='efi_guid_lenovo_diag_splash' visibility='default' filepath='src/guid-symbols.c' line='164' column='1' elf-symbol-id='efi_guid_lenovo_diag_splash@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_msg' type-id='type-id-43' mangled-name='efi_guid_lenovo_msg' visibility='default' filepath='src/guid-symbols.c' line='168' column='1' elf-symbol-id='efi_guid_lenovo_msg@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha256' type-id='type-id-43' mangled-name='efi_guid_sha256' visibility='default' filepath='src/guid-symbols.c' line='172' column='1' elf-symbol-id='efi_guid_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_shell' type-id='type-id-43' mangled-name='efi_guid_shell' visibility='default' filepath='src/guid-symbols.c' line='176' column='1' elf-symbol-id='efi_guid_shell@@libefivar.so.0'/>
    <var-decl name='efi_guid_security' type-id='type-id-43' mangled-name='efi_guid_security' visibility='default' filepath='src/guid-symbols.c' line='180' column='1' elf-symbol-id='efi_guid_security@@libefivar.so.0'/>
    <var-decl name='efi_guid_rsa2048_sha256' type-id='type-id-43' mangled-name='efi_guid_rsa2048_sha256' visibility='default' filepath='src/guid-symbols.c' line='184' column='1' elf-symbol-id='efi_guid_rsa2048_sha256@@libefivar.so.0'/>
    <var-decl name='efi_guid_lenovo_startup_interrupt' type-id='type-id-43' mangled-name='efi_guid_lenovo_startup_interrupt' visibility='default' filepath='src/guid-symbols.c' line='188' column='1' elf-symbol-id='efi_guid_lenovo_startup_interrupt@@libefivar.so.0'/>
    <var-decl name='efi_guid_sha384' type-id='type-id-43' mangled-name='efi_guid_sha384' visibility='default' filepath='src/guid-symbols.c' line='192' column='1' elf-symbol-id='efi_guid_sha384@@libefivar.so.0'/>
    <var-decl name='efi_n_well_known_guids' type-id='type-id-310' mangled-name='efi_n_well_known_guids' visibility='default' filepath='src/guid-symbols.c' line='196' column='1' elf-symbol-id='efi_n_well_known_guids@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_n_well_known_names' type-id='type-id-310' mangled-name='efi_n_well_known_names' visibility='default' filepath='src/guid-symbols.c' line='199' column='1' elf-symbol-id='efi_n_well_known_names@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_well_known_guids_' type-id='type-id-308' mangled-name='efi_well_known_guids_' visibility='default' filepath='src/guid-symbols.c' line='210' column='1' elf-symbol-id='efi_well_known_guids_@@libefivar.so.0'/>
    <var-decl name='efi_well_known_guids' type-id='type-id-311' mangled-name='efi_well_known_guids' visibility='default' filepath='src/guid-symbols.c' line='592' column='1' elf-symbol-id='efi_well_known_guids@@libefivar.so.0'/>
    <var-decl name='efi_well_known_guids_end' type-id='type-id-311' mangled-name='efi_well_known_guids_end' visibility='default' filepath='src/guid-symbols.c' line='595' column='1' elf-symbol-id='efi_well_known_guids_end@@libefivar.so.0'/>
    <var-decl name='efi_well_known_names_' type-id='type-id-308' mangled-name='efi_well_known_names_' visibility='default' filepath='src/guid-symbols.c' line='599' column='1' elf-symbol-id='efi_well_known_names_@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_well_known_names' type-id='type-id-311' mangled-name='efi_well_known_names' visibility='default' filepath='src/guid-symbols.c' line='981' column='1' elf-symbol-id='efi_well_known_names@@LIBEFIVAR_1.38'/>
    <var-decl name='efi_well_known_names_end' type-id='type-id-311' mangled-name='efi_well_known_names_end' visibility='default' filepath='src/guid-symbols.c' line='984' column='1' elf-symbol-id='efi_well_known_names_end@@LIBEFIVAR_1.38'/>
  </abi-instr>
  <abi-instr address-size='64' path='guid.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='efivar_guidname' size-in-bits='6272' is-struct='yes' visibility='default' filepath='src/guid-symbols.c' line='201' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guid' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='symbol' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='name' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='description' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-307'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-313'/>
    <qualified-type-def type-id='type-id-313' const='yes' id='type-id-311'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-310'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-316'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-317'/>
    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='src/guid.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-44' name='a' filepath='src/guid.c' line='20' column='1'/>
      <parameter type-id='type-id-44' name='b' filepath='src/guid.c' line='20' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='src/guid.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
      <parameter type-id='type-id-44' name='guid' filepath='src/guid.c' line='26' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' filepath='src/guid.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-38' name='s' filepath='src/guid.c' line='36' column='1'/>
      <parameter type-id='type-id-59' name='guid' filepath='src/guid.c' line='36' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='src/guid.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
      <parameter type-id='type-id-44' name='guid' filepath='src/guid.c' line='42' column='1'/>
      <parameter type-id='type-id-41' name='sp' filepath='src/guid.c' line='42' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' filepath='src/guid.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0'>
      <parameter type-id='type-id-59' name='guid' filepath='src/guid.c' line='105' column='1'/>
      <parameter type-id='type-id-41' name='name' filepath='src/guid.c' line='105' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' filepath='src/guid.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0'>
      <parameter type-id='type-id-59' name='guid' filepath='src/guid.c' line='120' column='1'/>
      <parameter type-id='type-id-41' name='symbol' filepath='src/guid.c' line='120' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' filepath='src/guid.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0'>
      <parameter type-id='type-id-44' name='guid' filepath='src/guid.c' line='134' column='1'/>
      <parameter type-id='type-id-41' name='sp' filepath='src/guid.c' line='134' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' filepath='src/guid.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
      <parameter type-id='type-id-38' name='name' filepath='src/guid.c' line='186' column='1'/>
      <parameter type-id='type-id-59' name='guid' filepath='src/guid.c' line='186' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-316' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-314'/>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='dlclose' filepath='/usr/include/dlfcn.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlclose'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strndup' filepath='/usr/include/string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strndup'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='lib.c' comp-dir-path='src' language='LANG_C11'>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='puts'>
      <return type-id='type-id-24'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-320'/>
    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' filepath='src/lib.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='33' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='33' column='1'/>
      <parameter type-id='type-id-57' name='data' filepath='src/lib.c' line='33' column='1'/>
      <parameter type-id='type-id-40' name='data_size' filepath='src/lib.c' line='34' column='1'/>
      <parameter type-id='type-id-37' name='attributes' filepath='src/lib.c' line='34' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' filepath='src/lib.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-57' name='data' filepath='src/lib.c' line='50' column='1'/>
      <parameter type-id='type-id-40' name='data_size' filepath='src/lib.c' line='51' column='1'/>
      <parameter type-id='type-id-37' name='attributes' filepath='src/lib.c' line='51' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' filepath='src/lib.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='67' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='67' column='1'/>
      <parameter type-id='type-id-57' name='data' filepath='src/lib.c' line='67' column='1'/>
      <parameter type-id='type-id-40' name='data_size' filepath='src/lib.c' line='68' column='1'/>
      <parameter type-id='type-id-37' name='attributes' filepath='src/lib.c' line='68' column='1'/>
      <parameter type-id='type-id-256' name='mode' filepath='src/lib.c' line='68' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' filepath='src/lib.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='90' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='90' column='1'/>
      <parameter type-id='type-id-57' name='data' filepath='src/lib.c' line='90' column='1'/>
      <parameter type-id='type-id-40' name='data_size' filepath='src/lib.c' line='91' column='1'/>
      <parameter type-id='type-id-37' name='attributes' filepath='src/lib.c' line='91' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' filepath='src/lib.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='112' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='112' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='src/lib.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='129' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='129' column='1'/>
      <parameter type-id='type-id-275' name='data' filepath='src/lib.c' line='129' column='1'/>
      <parameter type-id='type-id-270' name='data_size' filepath='src/lib.c' line='130' column='1'/>
      <parameter type-id='type-id-274' name='attributes' filepath='src/lib.c' line='130' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' filepath='src/lib.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='147' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='147' column='1'/>
      <parameter type-id='type-id-274' name='attributes' filepath='src/lib.c' line='148' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' filepath='src/lib.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='165' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='165' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' filepath='src/lib.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='172' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='172' column='1'/>
      <parameter type-id='type-id-270' name='size' filepath='src/lib.c' line='172' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' filepath='src/lib.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
      <parameter type-id='type-id-260' name='guid' filepath='src/lib.c' line='189' column='1'/>
      <parameter type-id='type-id-41' name='name' filepath='src/lib.c' line='189' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' filepath='src/lib.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
      <parameter type-id='type-id-42' name='guid' filepath='src/lib.c' line='206' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='src/lib.c' line='206' column='1'/>
      <parameter type-id='type-id-256' name='mode' filepath='src/lib.c' line='206' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='src/lib.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='efi_get_libefivar_version' mangled-name='efi_get_libefivar_version' filepath='src/lib.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefivar_version@@LIBEFIVAR_1.38'>
      <return type-id='type-id-37'/>
    </function-decl>
    <var-decl name='vars_ops' type-id='type-id-231' visibility='default' filepath='src/lib.h' line='47' column='1'/>
    <typedef-decl name='DIR' type-id='type-id-320' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-318'/>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='printf'>
      <parameter type-id='type-id-38'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='exit'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='strcasestr' filepath='/usr/include/string.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcasestr'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='time.c' comp-dir-path='src' language='LANG_C11'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-254' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' id='type-id-322'/>
    <qualified-type-def type-id='type-id-10' restrict='yes' id='type-id-323'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-324'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <qualified-type-def type-id='type-id-325' restrict='yes' id='type-id-326'/>
    <qualified-type-def type-id='type-id-321' const='yes' id='type-id-327'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-328' restrict='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-330' restrict='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-334'/>
    <typedef-decl name='DIR' type-id='type-id-334' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-332'/>
    <function-decl name='setenv' filepath='/usr/include/stdlib.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setenv'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='unsetenv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unsetenv'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime'>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-322'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strftime'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='strptime' filepath='/usr/include/time.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strptime'>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gmtime_r' filepath='/usr/include/time.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gmtime_r'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='localtime_r' filepath='/usr/include/time.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localtime_r'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='asctime' filepath='/usr/include/time.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asctime'>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-10'/>
    </function-decl>
